emas/loadtest/emas-performance-report/raw_data/sp4/apache_bench_data/1cus/varnish_ab_test_1_1000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      1
Time taken for tests:   4.124 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      32552000 bytes
HTML transferred:       31966000 bytes
Requests per second:    242.47 [#/sec] (mean)
Time per request:       4.124 [ms] (mean)
Time per request:       4.124 [ms] (mean, across all concurrent requests)
Transfer rate:          7708.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.0      1       1
Processing:     3    4   0.0      4       4
Waiting:        1    1   0.0      1       1
Total:          4    4   0.0      4       4

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      4
  95%      4
  98%      4
  99%      4
 100%      4 (longest request)